#-*-coding:utf8 -*-

'''读取xlsx到三个txt中
'''
# import xlrd

# data = xlrd.open_workbook('3disease.xlsx')
# files = ['gxy.txt','tnb.txt','xxgb.txt']
# for i in range(len(files)):
# 	file = files[i]
# 	with open(file,'r') as f:
# 		table = data.sheets()[i]
# 		for j in range(table.nrows):
# 			f.write(' '.join(map(str,table.row_values(j)))+'\n')

'''
读取xlsx检验表，所有中文

'''
# import re 
# import pdb

# def is_chinese(str):
# 	pt =re.compile(u'[\u4e00-\u9fa5]');#这里要加u,注意
# 	res = pt.findall(str)
# 	return res

# Res=[]
# files = ['gxy.txt','tnb.txt','xxgb.txt']
# for file in files:
# 	with open(file,'r') as f:
# 		for line in f.readlines():
# 			#pdb.set_trace()
# 			res = is_chinese(line)
# 			for x in res:
# 				if x not in Res:
# 					Res.append(x)


'''
返回６０７个汉字对应的编码

'''
'''
dic = ['住', '院', '号', '年', '龄', '性', '别', '样', '本', '检', '验', '目', '的', '项', '代', '测', '定', '值', '单', '位', '参', '考', '日', '期', '男', '术', '前', '四', '抗', '梅', '毒', '螺', '旋', '体', '特', '异', '弱', '阳', '阴', '丙', '型', '肝', '炎', '乙', '表', '面', '原', '人', '免', '疫', '缺', '陷', '病', '粪', '便', '常', '规', '寄', '生', '虫', '卵', '镜', '计', '数', '颜', '色', '黄', '状', '软', '蛔', '未', '查', '见', '钩', '鞭', '吞', '噬', '细', '胞', '油', '滴', '夏', '雷', '登', '氏', '脓', '霉', '菌', '孢', '子', '红', '白', '不', '消', '化', '食', '物', '隐', '血', '试', '脑', '脊', '液', '房', '有', '核', '清', '晰', '度', '透', '明', '外', '观', '无', '潘', '肌', '钙', '蛋', '量', '尿', '亚', '硝', '酸', '盐', '质', '酮', '浊', '胆', '素', '葡', '萄', '糖', '管', '类', '酵', '母', '粘', '丝', '结', '晶', '比', '重', '上', '皮', '电', '导', '率', '淡', '脂', '酶', '正', '肿', '瘤', '标', '志', '铁', '甲', '胎', '癌', '胚', '链', '三', '系', '心', '肾', '解', '极', '低', '密', '固', '醇', '甘', '酯', '机', '磷', '高', '球', '腺', '苷', '脱', '氨', '氯', '钠', '天', '门', '冬', '基', '转', '移', '总', '岩', '藻', '直', '接', '间', '钾', '汁', '氮', '碱', '谷', '酰', '脯', '二', '肽', '酐', '反', '应', '谱', '激', '同', '工', '活', '羟', '丁', '氢', '乳', '五', '分', '嗜', '粒', '小', '板', '压', '积', '淋', '巴', '平', '均', '布', '宽', '中', '浓', '含', '凝', '功', '能', '聚', '国', '际', '准', '时', '对', '照', '秒', '纤', '维', '部', '超', '敏', '快', '速', '法', '胱', '抑', '滤', '过', '暗', '气', '析', '全', '实', '剩', '余', '吸', '入', '氧', '流', '碳', '根', '温', '纠', '后', '离', '隙', '饱', '和', '渗', '输', '棕', '于', '限', '镁', '套', '碘', '游', '促', '说', '女', '自', '费', '褐', '沉', '降', '动', '脉', '淀', '粉', '引', '急', '诊', '环', '瓜', '风', '湿', '因', '溶', '着', '点', '双', '列', '黑', '糊', '烂', '绿', '泳', '网', '织', '百', '纳', '端', '利', '胸', '水', '李', '凡', '他', '块', '浑', '或', '草', '群', '传', '研', '鳞', '相', '关', '神', '经', '元', '烯', '角', '片', '段', '枝', '杆', '静', '餐', '腹', '补', '随', '微', '视', '合', '内', '科', '两', '周', '颗', '力', '旁', '拷', '贝', '载', '半', '紧', '张', '浆', '饮', '立', '卧', '醛', '普', '通', '稀', '建', '议', '复', '成', '胺', '一', '空', '巨', '辩', '果', '详', '胰', '岛', '释', '放', '亮', '绒', '毛', '膜', '线', '组', '增', '殖', '纺', '锤', '波', '形', '尔', '髓', '备', '注', '呕', '吐', '绝', '底', '及', '戊', '庚', '非', '轻', '澈', '药', '克', '莫', '司', '骨', '谢', '胶', '殊', '序', '延', '长', '会', '感', '染', '荧', '光', '多', '室', '辅', '助', '制', '个', '共', '读', '植', '用', '硬', '羧', '集', '露', '真', '干', '扰', '严', '残', '留', '灶', '式', '图', '文', '报', '告', '涂', '其', '学', '灰', '腔', '仅', '供', '糜', '米', '可', '浅', '肠', '道', '种', '优', '势', '歧', '酪', '梭', '拉', '柔', '嫩', '论', '呼', '钟', '帕', '深', '祥', '隆', '孕', '泡', '泌', '怀', '雌', '排', '刺', '身', '滑', '睾', '少', '万', '鉴', '请', '簇', '所', '幼', '稚', '偶', '带', '培', '养', '叶', '层', '混', '已', '橙', '地', '辛', '岁', '以', '栓', '弹', '发', '鲎', '例', '酚', '连', '铜', '蓝', '肺', '支', '情', '石', '份', '杂', '交', '幽', '现', '症', '服', '附', '纯', '疱', '疹', '弓', '行', '出', '热', '综', '停', '华', '林', '儿', '茶', '去', '肪', '唾', '洁', '季', '节', '新', '咖', '啡', '效', '价', '器', '官', '库', '融', '临', '床', '澄', '古', '峰', '指', '受', '今', '早', '抽', '昨', '晚', '则', '筛', '耐', '下', '大', '黏', '每', '切', '迹', '做', '除', '次', '始', '介', '坏', '死', '灵', '芝', '界', '苯', '加', '突', '变', '衣', '军', '团', '副', '与', '沟']
dic_code = [u'\u4f4f', u'\u9662', u'\u53f7', u'\u5e74', u'\u9f84', u'\u6027', u'\u522b', u'\u6837', u'\u672c', u'\u68c0', u'\u9a8c', u'\u76ee', u'\u7684', u'\u9879', u'\u4ee3', u'\u6d4b', u'\u5b9a', u'\u503c', u'\u5355', u'\u4f4d', u'\u53c2', u'\u8003', u'\u65e5', u'\u671f', u'\u7537', u'\u672f', u'\u524d', u'\u56db', u'\u6297', u'\u6885', u'\u6bd2', u'\u87ba', u'\u65cb', u'\u4f53', u'\u7279', u'\u5f02', u'\u5f31', u'\u9633', u'\u9634', u'\u4e19', u'\u578b', u'\u809d', u'\u708e', u'\u4e59', u'\u8868', u'\u9762', u'\u539f', u'\u4eba', u'\u514d', u'\u75ab', u'\u7f3a', u'\u9677', u'\u75c5', u'\u7caa', u'\u4fbf', u'\u5e38', u'\u89c4', u'\u5bc4', u'\u751f', u'\u866b', u'\u5375', u'\u955c', u'\u8ba1', u'\u6570', u'\u989c', u'\u8272', u'\u9ec4', u'\u72b6', u'\u8f6f', u'\u86d4', u'\u672a', u'\u67e5', u'\u89c1', u'\u94a9', u'\u97ad', u'\u541e', u'\u566c', u'\u7ec6', u'\u80de', u'\u6cb9', u'\u6ef4', u'\u590f', u'\u96f7', u'\u767b', u'\u6c0f', u'\u8113', u'\u9709', u'\u83cc', u'\u5b62', u'\u5b50', u'\u7ea2', u'\u767d', u'\u4e0d', u'\u6d88', u'\u5316', u'\u98df', u'\u7269', u'\u9690', u'\u8840', u'\u8bd5', u'\u8111', u'\u810a', u'\u6db2', u'\u623f', u'\u6709', u'\u6838', u'\u6e05', u'\u6670', u'\u5ea6', u'\u900f', u'\u660e', u'\u5916', u'\u89c2', u'\u65e0', u'\u6f58', u'\u808c', u'\u9499', u'\u86cb', u'\u91cf', u'\u5c3f', u'\u4e9a', u'\u785d', u'\u9178', u'\u76d0', u'\u8d28', u'\u916e', u'\u6d4a', u'\u80c6', u'\u7d20', u'\u8461', u'\u8404', u'\u7cd6', u'\u7ba1', u'\u7c7b', u'\u9175', u'\u6bcd', u'\u7c98', u'\u4e1d', u'\u7ed3', u'\u6676', u'\u6bd4', u'\u91cd', u'\u4e0a', u'\u76ae', u'\u7535', u'\u5bfc', u'\u7387', u'\u6de1', u'\u8102', u'\u9176', u'\u6b63', u'\u80bf', u'\u7624', u'\u6807', u'\u5fd7', u'\u94c1', u'\u7532', u'\u80ce', u'\u764c', u'\u80da', u'\u94fe', u'\u4e09', u'\u7cfb', u'\u5fc3', u'\u80be', u'\u89e3', u'\u6781', u'\u4f4e', u'\u5bc6', u'\u56fa', u'\u9187', u'\u7518', u'\u916f', u'\u673a', u'\u78f7', u'\u9ad8', u'\u7403', u'\u817a', u'\u82f7', u'\u8131', u'\u6c28', u'\u6c2f', u'\u94a0', u'\u5929', u'\u95e8', u'\u51ac', u'\u57fa', u'\u8f6c', u'\u79fb', u'\u603b', u'\u5ca9', u'\u85fb', u'\u76f4', u'\u63a5', u'\u95f4', u'\u94be', u'\u6c41', u'\u6c2e', u'\u78b1', u'\u8c37', u'\u9170', u'\u812f', u'\u4e8c', u'\u80bd', u'\u9150', u'\u53cd', u'\u5e94', u'\u8c31', u'\u6fc0', u'\u540c', u'\u5de5', u'\u6d3b', u'\u7f9f', u'\u4e01', u'\u6c22', u'\u4e73', u'\u4e94', u'\u5206', u'\u55dc', u'\u7c92', u'\u5c0f', u'\u677f', u'\u538b', u'\u79ef', u'\u6dcb', u'\u5df4', u'\u5e73', u'\u5747', u'\u5e03', u'\u5bbd', u'\u4e2d', u'\u6d53', u'\u542b', u'\u51dd', u'\u529f', u'\u80fd', u'\u805a', u'\u56fd', u'\u9645', u'\u51c6', u'\u65f6', u'\u5bf9', u'\u7167', u'\u79d2', u'\u7ea4', u'\u7ef4', u'\u90e8', u'\u8d85', u'\u654f', u'\u5feb', u'\u901f', u'\u6cd5', u'\u80f1', u'\u6291', u'\u6ee4', u'\u8fc7', u'\u6697', u'\u6c14', u'\u6790', u'\u5168', u'\u5b9e', u'\u5269', u'\u4f59', u'\u5438', u'\u5165', u'\u6c27', u'\u6d41', u'\u78b3', u'\u6839', u'\u6e29', u'\u7ea0', u'\u540e', u'\u79bb', u'\u9699', u'\u9971', u'\u548c', u'\u6e17', u'\u8f93', u'\u68d5', u'\u4e8e', u'\u9650', u'\u9541', u'\u5957', u'\u7898', u'\u6e38', u'\u4fc3', u'\u8bf4', u'\u5973', u'\u81ea', u'\u8d39', u'\u8910', u'\u6c89', u'\u964d', u'\u52a8', u'\u8109', u'\u6dc0', u'\u7c89', u'\u5f15', u'\u6025', u'\u8bca', u'\u73af', u'\u74dc', u'\u98ce', u'\u6e7f', u'\u56e0', u'\u6eb6', u'\u7740', u'\u70b9', u'\u53cc', u'\u5217', u'\u9ed1', u'\u7cca', u'\u70c2', u'\u7eff', u'\u6cf3', u'\u7f51', u'\u7ec7', u'\u767e', u'\u7eb3', u'\u7aef', u'\u5229', u'\u80f8', u'\u6c34', u'\u674e', u'\u51e1', u'\u4ed6', u'\u5757', u'\u6d51', u'\u6216', u'\u8349', u'\u7fa4', u'\u4f20', u'\u7814', u'\u9cde', u'\u76f8', u'\u5173', u'\u795e', u'\u7ecf', u'\u5143', u'\u70ef', u'\u89d2', u'\u7247', u'\u6bb5', u'\u679d', u'\u6746', u'\u9759', u'\u9910', u'\u8179', u'\u8865', u'\u968f', u'\u5fae', u'\u89c6', u'\u5408', u'\u5185', u'\u79d1', u'\u4e24', u'\u5468', u'\u9897', u'\u529b', u'\u65c1', u'\u62f7', u'\u8d1d', u'\u8f7d', u'\u534a', u'\u7d27', u'\u5f20', u'\u6d46', u'\u996e', u'\u7acb', u'\u5367', u'\u919b', u'\u666e', u'\u901a', u'\u7a00', u'\u5efa', u'\u8bae', u'\u590d', u'\u6210', u'\u80fa', u'\u4e00', u'\u7a7a', u'\u5de8', u'\u8fa9', u'\u679c', u'\u8be6', u'\u80f0', u'\u5c9b', u'\u91ca', u'\u653e', u'\u4eae', u'\u7ed2', u'\u6bdb', u'\u819c', u'\u7ebf', u'\u7ec4', u'\u589e', u'\u6b96', u'\u7eba', u'\u9524', u'\u6ce2', u'\u5f62', u'\u5c14', u'\u9ad3', u'\u5907', u'\u6ce8', u'\u5455', u'\u5410', u'\u7edd', u'\u5e95', u'\u53ca', u'\u620a', u'\u5e9a', u'\u975e', u'\u8f7b', u'\u6f88', u'\u836f', u'\u514b', u'\u83ab', u'\u53f8', u'\u9aa8', u'\u8c22', u'\u80f6', u'\u6b8a', u'\u5e8f', u'\u5ef6', u'\u957f', u'\u4f1a', u'\u611f', u'\u67d3', u'\u8367', u'\u5149', u'\u591a', u'\u5ba4', u'\u8f85', u'\u52a9', u'\u5236', u'\u4e2a', u'\u5171', u'\u8bfb', u'\u690d', u'\u7528', u'\u786c', u'\u7fa7', u'\u96c6', u'\u9732', u'\u771f', u'\u5e72', u'\u6270', u'\u4e25', u'\u6b8b', u'\u7559', u'\u7076', u'\u5f0f', u'\u56fe', u'\u6587', u'\u62a5', u'\u544a', u'\u6d82', u'\u5176', u'\u5b66', u'\u7070', u'\u8154', u'\u4ec5', u'\u4f9b', u'\u7cdc', u'\u7c73', u'\u53ef', u'\u6d45', u'\u80a0', u'\u9053', u'\u79cd', u'\u4f18', u'\u52bf', u'\u6b67', u'\u916a', u'\u68ad', u'\u62c9', u'\u67d4', u'\u5ae9', u'\u8bba', u'\u547c', u'\u949f', u'\u5e15', u'\u6df1', u'\u7965', u'\u9686', u'\u5b55', u'\u6ce1', u'\u6ccc', u'\u6000', u'\u96cc', u'\u6392', u'\u523a', u'\u8eab', u'\u6ed1', u'\u777e', u'\u5c11', u'\u4e07', u'\u9274', u'\u8bf7', u'\u7c07', u'\u6240', u'\u5e7c', u'\u7a1a', u'\u5076', u'\u5e26', u'\u57f9', u'\u517b', u'\u53f6', u'\u5c42', u'\u6df7', u'\u5df2', u'\u6a59', u'\u5730', u'\u8f9b', u'\u5c81', u'\u4ee5', u'\u6813', u'\u5f39', u'\u53d1', u'\u9c8e', u'\u4f8b', u'\u915a', u'\u8fde', u'\u94dc', u'\u84dd', u'\u80ba', u'\u652f', u'\u60c5', u'\u77f3', u'\u4efd', u'\u6742', u'\u4ea4', u'\u5e7d', u'\u73b0', u'\u75c7', u'\u670d', u'\u9644', u'\u7eaf', u'\u75b1', u'\u75b9', u'\u5f13', u'\u884c', u'\u51fa', u'\u70ed', u'\u7efc', u'\u505c', u'\u534e', u'\u6797', u'\u513f', u'\u8336', u'\u53bb', u'\u80aa', u'\u553e', u'\u6d01', u'\u5b63', u'\u8282', u'\u65b0', u'\u5496', u'\u5561', u'\u6548', u'\u4ef7', u'\u5668', u'\u5b98', u'\u5e93', u'\u878d', u'\u4e34', u'\u5e8a', u'\u6f84', u'\u53e4', u'\u5cf0', u'\u6307', u'\u53d7', u'\u4eca', u'\u65e9', u'\u62bd', u'\u6628', u'\u665a', u'\u5219', u'\u7b5b', u'\u8010', u'\u4e0b', u'\u5927', u'\u9ecf', u'\u6bcf', u'\u5207', u'\u8ff9', u'\u505a', u'\u9664', u'\u6b21', u'\u59cb', u'\u4ecb', u'\u574f', u'\u6b7b', u'\u7075', u'\u829d', u'\u754c', u'\u82ef', u'\u52a0', u'\u7a81', u'\u53d8', u'\u8863', u'\u519b', u'\u56e2', u'\u526f', u'\u4e0e', u'\u6c9f']
'''

# with open('测定值.txt','r') as f:
# 	g = open('测定值2.txt','w')
# 	lines = f.readlines()
# 	items = []
# 	for line in lines:
# 		if line not in items:
# 			items.append(line)
# 			g.write(line)
# 	g.close()
# print(len(items))#3470

with open("参考值2.txt",'r') as f:
	lines = f.readlines()
	items = []
	for line in lines:
		items.append(line[:-1])
print(items)
print(len(items))











