#-*- coding:utf8 -*-

import random

charset = "单位NUL/hpμlngmoSceuPd%10E9f2秒 FiDCOIHskM小时或℃A4拷贝个G-万K5WB3月日.867男：女<尿天随机~:≥绝经前—后;+正常饮食低钠卵泡期黄体未怀孕排X岁*^少见检测项目抗梅毒螺旋特异性（T)丙型肝炎(tV乙表面原人免疫缺陷病颜色状蛔虫钩鞭吞噬细胞油滴夏雷登氏脓霉菌孢子红白不消化物隐血试验R有核清晰度外观潘肌钙蛋亚硝酸盐质酮浊胆素葡萄糖管类酵母粘液丝结晶比重上皮电导率值脂酶甲胎铁r癌胚链定心极密固醇）甘三酯无磷高球腺苷脱氨氯a门冬基转移总α岩藻直接b间钾汁氮碱γ谷酰脯二肽酐脑脊反应激同工活羟丁氢乳嗜粒板压积淋巴平均分布宽计数中浓含量国际标准凝对照聚纤维部超敏胱抑y肾滤过全实剩余吸入氧流碳根温纠阴离隙饱和渗透镁碘游促说明沉降淀粉引Y环瓜风湿因溶双J着点列β网织百端利急诊李凡他草鳞相关神元烯角片段枝杆胸水补视合微Ⅰ周本颗快速力旁内载半镜纳紧张浆醛Ⅱ生成胺餐巨腹胰岛绒毛膜线组增殖纺锤动波形尔髓备注析底戊庚非轻λ药克莫司胶殊序骨延长辅助制共读,群空羧露真稀释其糜集，可肠歧酪梭普拉柔嫩感染论呼气钟果帕卧隆κ泌雌刺滑睾幼稚叶层地辛鲎放例酚连ⅣⅢ鉴铜蓝肺支一灰石q幽现症服附纯疱疹弓综出热多去肪的术四粪便规寄、查[房]肿瘤志＋系解谱五功能法输套自费脉泳传研静科两辩呕吐及代谢会荧光室植用残留灶式涂学道种优势身簇所带培养－栓弹图份杂交行儿茶弱阳软淡棕于限褐>黑糊烂绿块浑建议复详亮暗澈±硬干扰严文报告腔仅供参考米|"


with open('data.txt','w') as f:
	for i in range(50000):
		k = random.randint(4,8)
		line = ''.join(random.sample(charset,k))
		f.write(line+'\n')

